Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/moving_country/moving_to_ireland/introduction_to_the_irish_system/accommodation.html.txt.tmx
Source language: en
Languages: ga

source: You should arrange accommodation before you arrive in Ireland, even for the first few days of your stay
ga: Má's féidir leat an lóistín a shocrú roimh ré, fiú don chéad cúpla lá ní bheidh tú chomh buartha

source: Organise in advance to stay with friends or book yourself in to a hotel or a hostel in order to give yourself time to look around and get to grips with the accommodation situation in the area in which you plan to live
ga: Socraigh roimh ré fanacht le cáirde, nó cuir óstán nó brú in áirithe, le seans a thabhairt duit féin féachaint thart agus scéal an íostais san áit go bhfuil tú ag maireachtáil, a mheas

source: If you are thinking of buying a house, you need to be aware of the price trends in this country, the process by which houses are bought and sold and the initial costs that are involved
ga: Caithfidh tú a bheith san airdeall ar chlaonadh praghas na dtithe sa tír seo, má tá tú ag smaoineamh teach a cheannach, an modh ceannacháin agus díolacháin títhe agus na costaisí tosaigh atá i gceist

source: Rented accommodation comes in many forms
ga: Tá go leor cinéail lóistincíosa ann

source: You can choose from houses, flats, apartments, house-shares and bed-sits, according to what suits your needs and your budget
ga: Beidh tú ábalta roghnú ar thíthe, árasáin, páirtíocht tithíochta agus seomraí suite codlata, ag brath céard a shásaíonn do chuid riachtanaisí féin agus do chuid airigid

source: You will need to know how these are advertised and rented and what your rights and responsibilities are as a tenant
ga: Caithfidh tú fios a bheith agat cé'n chaoi a bhfuil siad seo fógraithe agus ligthe, agus céard iad do chearta agus do fhreagracht mar thionónta

source: Local authorities are the main providers of social housing for people who cannot afford to buy their own homes
ga: Níl aon srianta ar cheannacht nó ligean ar cíos maidir le áitreabh cónaithe nó talamh neamthalamhaíochta

source: There are no restrictions on the purchase or rent of residential property or non-agricultural land. How to apply
ga: Is iad na húdaráis áitiúla is mó a chuireann tithíocht shóisialta ar fáil do dhaoine a dteastaíonn tithe uathu ach nach bhfuil in acmhainn a gcuid tithe féin a cheannach

source: Threshold is a voluntary organisation that gives information and advice to citizens about rented accommodation
ga: Caithfidh náisiúnaigh neamh-Éireannacha ceart dlíthiúil chun fanacht sa Stát a bheith acu chun cáiliú iarratas ar thithíocht shóisialta a dhéanamh
